// pages/my/order/order-express.ts
Page({


  data: {
    statusHeight: getApp<IAppOption>().globalData.statusHeight! + 44,
    bottomHeight: getApp<IAppOption>().globalData.bottomHeight,
    steps: [
      {
        text: '2023.07.16 11:11 星期天',
        desc: '快件已【朋友或同事】签收，如有疑问请联系派件员：15091447632，投诉电话：029-81363383。起早贪黑不停忙，如有不妥您见谅，好评激励我向上，求个五星暖心房。',
      },
      {
        text: '2023.07.16 10:53',
        desc: '[西安市【陕西临潼公司】的申通小哥(石油城申通快递/15091447632)正在为您派送(可放心接听95089申通专属派送号码)，投诉电话:029-81363383',
      },
      {
        text: '2023.07.16 07:45',
        desc: '[西安市]快件已到【陕西临潼公司】咨询电话：029-81363383',
      },
      {
        text: '2023.07.16 04:28',
        desc: '[咸阳市]快件离【陕西西安转运中心】已发【陕西临潼公司】',
      },
      {
        text: '2023.07.16 04:08 星期天',
        desc: '[咸阳市]快件已到【陕西西安转运中心】',
      },
      {
        text: '2023.07.14 22:21',
        desc: '[揭阳市]快件离【广东揭阳转运中心】已发【陕西西安转运中心】',
      },
      {
        text: '2023.07.14 22:19',
        desc: '[揭阳市]快件已到【广东揭阳转运中心】',
      },
      {
        text: '2023.07.14 21:03',
        desc: '[揭阳市]快件离【广东揭阳公司】已发【广东揭阳转运中心】',
      },
      {
        text: '2023.07.14 16:34 星期五',
        desc: '【广东揭阳公司】的【云路余辉飞】已揽收',
      },
    ],
  },

  onLoad() {

  },

  onReady() {

  },
  
})